Revit 2027 API
IFCLinkOrientation Enumeration
 IFC Link Orientation within the Host Document.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum IFCLinkOrientation
Public Enumeration IFCLinkOrientation
public enum class IFCLinkOrientation
type IFCLinkOrientation
Members
Member name | Value | Description
ProjectNorth | 0 |  Orient IFC File to Project North.
TrueNorth | 1 |  Orient IFC File to True North.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace